Catalogs/ЭлементыКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЭлементыКонструктораВидовПродукцииИС</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Атрибуты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МестаПримененияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>МестаПримененияЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Изменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоПрименения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаПримененияЭлементовКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Изменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Атрибуты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДоступныеЗначенияПоМестамПримененияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДоступныеЗначенияПоМестамПримененияЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Изменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоПрименения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаПримененияЭлементовКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ЭлементыКонструктораВидовПродукцииИС/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		КонструкторИСОбщегоНазначенияКлиентСервер.ДанныеЭлементаКонструктора(Объект.Ссылка);
	КонецЕсли;
	
	ПроверитьВозможностьИспользования(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьДанныеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеДанныхКонструктораВидовПродукцииИС" Тогда
		ОбновитьДанныеФормы();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗначения

&НаКлиенте
Процедура ЗначенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	ПараметрыОткрытия = Новый Структура;
	
	Если ТекущиеДанные.СтатусСтроки = 5 Тогда
		ИмяРегистра = "ЗначенияЭлементовКонструктораВидовПродукцииИС";
		ПараметрыОткрытия.Вставить("ТолькоПросмотр", Истина);
	Иначе
		ИмяРегистра = "ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС";
	КонецЕсли;
	
	ПараметрыКлючаЗаписи = Новый Структура;
	ПараметрыКлючаЗаписи.Вставить("ЭлементКонструктора", Объект.Ссылка);
	ПараметрыКлючаЗаписи.Вставить("ВидПродукции",        ТекущиеДанные.ВидПродукции);
	ПараметрыКлючаЗаписи.Вставить("Значение",            ТекущиеДанные.Значение);
	
	ПараметрыОткрытия.Вставить("Ключ", ПолучитьКлючЗаписи(ИмяРегистра, ПараметрыКлючаЗаписи));
	
	ОткрытьФорму(СтрШаблон("РегистрСведений.%1.ФормаЗаписи", ИмяРегистра),
		ПараметрыОткрытия,
		ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", Новый Структура);
	ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("ЭлементКонструктора", Объект.Ссылка);
	
	Если Копирование Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("ВидПродукции", ТекущиеДанные.ВидПродукции);
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("Значение", ТекущиеДанные.Значение);
		КонецЕсли;
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.ФормаЗаписи",
		ПараметрыОткрытия,
		ЭтотОбъект,,,,
		ОписаниеОповещенияОкончаниеИзмененияЗначений());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ЭлементКонструктора", Объект.Ссылка);
	ПараметрыЗаписи.Вставить("Данные", Новый Массив);
	
	ЕстьДанныеДляПометкиУдаления = Ложь;
	
	Для Каждого ВыделеннаяСтрока Из Элемент.ВыделенныеСтроки Цикл
		ТекущиеДанные = Значения.НайтиПоИдентификатору(ВыделеннаяСтрока);
		СтрокаДанных = Новый Структура;
		СтрокаДанных.Вставить("ИмяРегистра",     "ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС");
		СтрокаДанных.Вставить("ВидПродукции",    ТекущиеДанные.ВидПродукции);
		СтрокаДанных.Вставить("Значение",        ТекущиеДанные.Значение);
		СтрокаДанных.Вставить("УдалитьЗапись",   Ложь);
		СтрокаДанных.Вставить("ПометкаУдаления", Ложь);
		Если ТекущиеДанные.СтатусСтроки = 3
			Или ТекущиеДанные.СтатусСтроки = 4 Тогда
			СтрокаДанных.УдалитьЗапись = Истина;
		ИначеЕсли ТекущиеДанные.СтатусСтроки = 5 Тогда
			СтрокаДанных.ПометкаУдаления = Истина;
			ЕстьДанныеДляПометкиУдаления = Истина;
		Иначе
			Продолжить;
		КонецЕсли;
		ПараметрыЗаписи.Данные.Добавить(СтрокаДанных);
	КонецЦикла;
	
	Если ЕстьДанныеДляПометкиУдаления Тогда
		УдалитьИзДанныхНеПомеченныеНаУдаление(ПараметрыЗаписи.Данные);
	КонецЕсли;
	
	Если ПараметрыЗаписи.Данные.Количество() > 0 Тогда
		ИзменитьДанныеРегистров(ПараметрыЗаписи);
		ОбновитьДанныеФормы();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМестаПрименения

&НаКлиенте
Процедура МестаПримененияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные.СтатусСтроки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРегистра = "МестаПримененияЭлементовКонструктораВидовПродукцииИС";
	
	ПараметрыКлючаЗаписи = Новый Структура;
	ПараметрыКлючаЗаписи.Вставить("ЭлементКонструктора", Объект.Ссылка);
	ПараметрыКлючаЗаписи.Вставить("МестоПрименения",     ТекущиеДанные.МестоПрименения);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ", ПолучитьКлючЗаписи(ИмяРегистра, ПараметрыКлючаЗаписи));
	ПараметрыОткрытия.Вставить("ТолькоПросмотр", Истина);
	
	ОткрытьФорму(СтрШаблон("РегистрСведений.%1.ФормаЗаписи", ИмяРегистра),
		ПараметрыОткрытия,
		ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура МестаПримененияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", Новый Структура);
	ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("ЭлементКонструктора", Объект.Ссылка);
	ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("Изменен", Истина);
	
	Если Копирование Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("МестоПрименения", ТекущиеДанные.МестоПрименения);
		КонецЕсли;
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.МестаПримененияЭлементовКонструктораВидовПродукцииИС.ФормаЗаписи",
		ПараметрыОткрытия,
		ЭтотОбъект,,,,
		ОписаниеОповещенияОкончаниеИзмененияЗначений());
	
КонецПроцедуры

&НаКлиенте
Процедура МестаПримененияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ЭлементКонструктора", Объект.Ссылка);
	ПараметрыЗаписи.Вставить("Данные", Новый Массив);
	
	ЕстьДанныеДляПометкиУдаления = Ложь;
	
	Для Каждого ВыделеннаяСтрока Из Элемент.ВыделенныеСтроки Цикл
		ТекущиеДанные = МестаПрименения.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если ТекущиеДанные.СтатусСтроки <> 0 Тогда
			СтрокаДанных = Новый Структура;
			СтрокаДанных.Вставить("ИмяРегистра",     "МестаПримененияЭлементовКонструктораВидовПродукцииИС");
			СтрокаДанных.Вставить("МестоПрименения", ТекущиеДанные.МестоПрименения);
			СтрокаДанных.Вставить("ПометкаУдаления", ТекущиеДанные.СтатусСтроки <> 4);
			Если СтрокаДанных.ПометкаУдаления Тогда
				ЕстьДанныеДляПометкиУдаления = Истина;
			КонецЕсли;
			ПараметрыЗаписи.Данные.Добавить(СтрокаДанных);
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьДанныеДляПометкиУдаления Тогда
		УдалитьИзДанныхНеПомеченныеНаУдаление(ПараметрыЗаписи.Данные);
	КонецЕсли;
	
	Если ПараметрыЗаписи.Данные.Количество() > 0 Тогда
		ИзменитьДанныеРегистров(ПараметрыЗаписи);
		ОбновитьДанныеФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МестаПримененияПриАктивизацииСтроки(Элемент)
	
	УстановитьПризнакИспользованияЗначенияПоМестуПрименения(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоступныеЗначения

&НаКлиенте
Процедура ДоступныеЗначенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МестаПримененияТекущиеДанные = Элементы.МестаПрименения.ТекущиеДанные;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("Данные", Новый Массив);
	
	Для Каждого ВыделеннаяСтрока Из Элемент.ВыделенныеСтроки Цикл
		СтрокаДанных = Новый Структура;
		СтрокаДанных.Вставить("ЗаписатьДоступноеЗначение", Ложь);
		СтрокаДанных.Вставить("ЗаписатьДоступноеЗначениеПоМестуПрименения", Ложь);
		ТекущиеДанные = ДоступныеЗначения.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если МестаПримененияТекущиеДанные.СтатусСтроки = 0
			И ТекущиеДанные.СтатусСтроки = СтатусСтрокиИспользуетсяИНедоступно() Тогда
			СтрокаДанных.ЗаписатьДоступноеЗначение = Истина;
		ИначеЕсли МестаПримененияТекущиеДанные.СтатусСтроки <> 0
			И Не ТекущиеДанные.ИспользуетсяПоМестуПрименения
			И ТекущиеДанные.СтатусСтроки <> 4 Тогда
			СтрокаДанных.ЗаписатьДоступноеЗначениеПоМестуПрименения = Истина;
			Если ТекущиеДанные.СтатусСтроки = СтатусСтрокиИспользуетсяИНедоступно() Тогда
				СтрокаДанных.ЗаписатьДоступноеЗначение = Истина;
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли;
		СтрокаДанных.Вставить("Значение", ТекущиеДанные.Значение);
		ПараметрыЗаписи.Данные.Добавить(СтрокаДанных);
	КонецЦикла;
	
	КоличествоДобавляемыхЗначений = ПараметрыЗаписи.Данные.Количество();
	Если КоличествоДобавляемыхЗначений > 0 Тогда
		
		ПараметрыЗаписи.Вставить("ЭлементКонструктора", Объект.Ссылка);
		ПараметрыЗаписи.Вставить("МестоПрименения",     МестаПримененияТекущиеДанные.МестоПрименения);
		
		Если КоличествоДобавляемыхЗначений = 1 Тогда
			ТекстДополнения = "";
			ТекстЗаголовка = НСтр("ru = 'Добавить доступное значение'");
		Иначе
			ТекстДополнения = СтрШаблон(НСтр(
				"ru = ' + еще (%1)'"),
				КоличествоДобавляемыхЗначений - 1);
			ТекстЗаголовка = НСтр("ru = 'Добавить доступные значения'");
		КонецЕсли;
		
		Если МестаПримененияТекущиеДанные.СтатусСтроки = 0 Тогда
			ТекстВопроса = СтрШаблон(НСтр(
				"ru = 'Добавить %1%2 в доступные значения?'"),
				ПараметрыЗаписи.Данные[0].Значение,
				ТекстДополнения);
		Иначе
			ТекстВопроса = СтрШаблон(НСтр(
				"ru = 'Добавить %1%2 в доступные значения по месту применения %3?'"),
				ПараметрыЗаписи.Данные[0].Значение,
				ТекстДополнения,
				МестаПримененияТекущиеДанные.МестоПрименения);
		КонецЕсли;
		
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ВопросДобавитьДоступноеЗначение", ЭтотОбъект, ПараметрыЗаписи),
			ТекстВопроса,
			РежимДиалогаВопрос.ДаНет,,,
			ТекстЗаголовка);
		
	Иначе
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		ИмяРегистра = "ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС";
		
		ПараметрыКлючаЗаписи = Новый Структура;
		ПараметрыКлючаЗаписи.Вставить("ЭлементКонструктора", Объект.Ссылка);
		ПараметрыКлючаЗаписи.Вставить("Значение",            ТекущиеДанные.Значение);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Ключ", ПолучитьКлючЗаписи(ИмяРегистра, ПараметрыКлючаЗаписи));
		ПараметрыОткрытия.Вставить("ТолькоПросмотр", Истина);
		
		ОткрытьФорму(СтрШаблон("РегистрСведений.%1.ФормаЗаписи", ИмяРегистра),
			ПараметрыОткрытия,
			ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеЗначенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", Новый Структура);
	ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("ЭлементКонструктора", Объект.Ссылка);
	ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("Изменен", Истина);
	
	Если Копирование Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("Значение", ТекущиеДанные.Значение);
		КонецЕсли;
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС.ФормаЗаписи",
		ПараметрыОткрытия,
		ЭтотОбъект,,,,
		ОписаниеОповещенияОкончаниеИзмененияЗначений());
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеЗначенияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ЭлементКонструктора", Объект.Ссылка);
	ПараметрыЗаписи.Вставить("Данные", Новый Массив);
	
	ЕстьДанныеДляПометкиУдаления = Ложь;
	
	МестаПримененияТекущиеДанные = Элементы.МестаПрименения.ТекущиеДанные;
	Если МестаПримененияТекущиеДанные.СтатусСтроки = 0 Тогда
		ИмяРегистра = "ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС";
	Иначе
		ИмяРегистра = "ДоступныеЗначенияПоМестамПримененияЭлементовКонструктораВидовПродукцииИС";
	КонецЕсли;
	
	Для Каждого ВыделеннаяСтрока Из Элемент.ВыделенныеСтроки Цикл
		ТекущиеДанные = ДоступныеЗначения.НайтиПоИдентификатору(ВыделеннаяСтрока);
		СтрокаДанных = Новый Структура;
		СтрокаДанных.Вставить("Значение",        ТекущиеДанные.Значение);
		СтрокаДанных.Вставить("ПометкаУдаления", ТекущиеДанные.СтатусСтроки <> 4);
		Если СтрокаДанных.ПометкаУдаления Тогда
			ЕстьДанныеДляПометкиУдаления = Истина;
		КонецЕсли;
		Если МестаПримененияТекущиеДанные.СтатусСтроки = 0
			И ТекущиеДанные.СтатусСтроки = СтатусСтрокиИспользуетсяИНедоступно() Тогда
			Продолжить;
		ИначеЕсли МестаПримененияТекущиеДанные.СтатусСтроки = 0
			Или ТекущиеДанные.СтатусСтроки = 4 Тогда
			ИмяРегистра = "ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС";
		ИначеЕсли Не ТекущиеДанные.ИспользуетсяПоМестуПрименения Тогда
			Продолжить;
		Иначе
			СтрокаДанных.Вставить("МестоПрименения", МестаПримененияТекущиеДанные.МестоПрименения);
			ИмяРегистра = "ДоступныеЗначенияПоМестамПримененияЭлементовКонструктораВидовПродукцииИС";
		КонецЕсли;
		СтрокаДанных.Вставить("ИмяРегистра", ИмяРегистра);
		ПараметрыЗаписи.Данные.Добавить(СтрокаДанных);
	КонецЦикла;
	
	Если ЕстьДанныеДляПометкиУдаления Тогда
		УдалитьИзДанныхНеПомеченныеНаУдаление(ПараметрыЗаписи.Данные);
	КонецЕсли;
	
	Если ПараметрыЗаписи.Данные.Количество() > 0 Тогда
		ИзменитьДанныеРегистров(ПараметрыЗаписи);
		ОбновитьДанныеФормы();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьЭлемент(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЭлементКонструктора", Объект.Ссылка);
	
	ОткрытьФорму(
		"РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС.Форма.КонструкторВидовПродукцииИС",
		ПараметрыОткрытия,
		ЭтотОбъект,
		ПараметрыОткрытия.ЭлементКонструктора);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступныеЗначения(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЭлементКонструктора", Объект.Ссылка);
	
	ОткрытьФорму(
		"РегистрСведений.ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС.Форма.НастройкаДоступныхЗначений",
		ПараметрыОткрытия,
		ЭтотОбъект,
		ПараметрыОткрытия.ЭлементКонструктора);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьМестаПрименения(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЭлементКонструктора", Объект.Ссылка);
	
	ОткрытьФорму(
		"РегистрСведений.МестаПримененияЭлементовКонструктораВидовПродукцииИС.Форма.НастройкаМестПрименения",
		ПараметрыОткрытия,
		ЭтотОбъект,
		ПараметрыОткрытия.ЭлементКонструктора);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступныеЗначенияПоМестамПрименения(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЭлементКонструктора", Объект.Ссылка);
	
	ОткрытьФорму(
		"РегистрСведений.ДоступныеЗначенияПоМестамПримененияЭлементовКонструктораВидовПродукцииИС.Форма.НастройкаДоступныхЗначенийПоМестамПрименения",
		ПараметрыОткрытия,
		ЭтотОбъект,
		ПараметрыОткрытия.ЭлементКонструктора);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЭлементу(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоЭлементуПродолжение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.ЭлементыКонструктораВидовПродукцииИС.ФормаВыбора"
		,,ЭтотОбъект, УникальныйИдентификатор,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СравнитьВыделенныеВидыПродукцииСоСписком(Команда)
	
	ПоказатьВводСтроки(
		Новый ОписаниеОповещения("ПослеВводаСтрокиСТоварнымиГруппамиИзДокументации", ЭтотОбъект),,
		НСтр("ru = 'Введите строку с товарными группами из документации'"),, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьДоступныеЗначения(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("СкопироватьДоступныеЗначенияПродолжение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.ЭлементыКонструктораВидовПродукцииИС.ФормаВыбора"
		,,ЭтотОбъект, УникальныйИдентификатор,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Все места применения
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МестаПримененияМестоПрименения.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("МестаПрименения.СтатусСтроки");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<по всем>'"));
	
	// Доступные значения - Используется
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДоступныеЗначения.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("МестаПрименения.СтатусСтроки");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДоступныеЗначения.Используется");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
	
	// Доступные значения - ИспользуетсяПоМестуПрименения
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДоступныеЗначения.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("МестаПрименения.СтатусСтроки");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДоступныеЗначения.ИспользуетсяПоМестуПрименения");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	Если Не ПараметрыЭлементаПрочитаны Тогда
		ПрочитатьУстановитьПараметры();
		ПараметрыЭлементаПрочитаны = Истина;
	КонецЕсли;
	
	ЗаполнитьДанныеТаблиц();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеТаблиц()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЭлементКонструктора", Объект.Ссылка);
	Запрос.Текст = ТекстЗапросаДляЗаполненияДанныхТаблиц();
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВГраница = РезультатЗапроса.ВГраница();
	
	ИспользуемыеЗначения = Новый Массив;
	
	ОбработанныеСтроки = Новый Массив;
	СтруктураПоиска = Новый Структура;
	
	Выборка = РезультатЗапроса[ВГраница-3].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураПоиска.Вставить("ВидПродукции", Выборка.ВидПродукции);
		Если Параметризуется Тогда
			СтруктураПоиска.Вставить("Значение", Выборка.Значение);
		КонецЕсли;
		
		НайденныеСтроки = Значения.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Строка = Значения.Добавить();
		Иначе
			Строка = НайденныеСтроки[0];
		КонецЕсли;
		
		ОбработанныеСтроки.Добавить(Строка);
		
		ЗаполнитьЗначенияСвойств(Строка, Выборка,, "Атрибуты");
		Если Параметризуется Тогда
			Типы = Новый Массив;
			Типы.Добавить(ТипЗнч(Строка.Значение));
			Строка.Тип = Новый ОписаниеТипов(Типы);
			
			Если ИспользуемыеЗначения.Найти(Строка.Значение) = Неопределено Тогда
				ИспользуемыеЗначения.Добавить(Строка.Значение);
			КонецЕсли;
		КонецЕсли;
		
		Если ИспользоватьАтрибуты Тогда
			Строка.Атрибуты = ПредставлениеАтрибутов(Выборка.Атрибуты);
		КонецЕсли;
		
	КонецЦикла;
	
	УдалитьНеОбработанныеСтрокиИзТаблицы(Значения, ОбработанныеСтроки);
	
	ОбработанныеСтроки.Очистить();
	СтруктураПоиска.Очистить();
	
	Если Параметризуется Тогда
		Если МестаПрименения.Количество() = 0 Тогда
			Строка = МестаПрименения.Добавить();
		Иначе
			Строка = МестаПрименения[0];
		КонецЕсли;
		ОбработанныеСтроки.Добавить(Строка);
	КонецЕсли;
	
	Выборка = РезультатЗапроса[ВГраница-2].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураПоиска.Вставить("МестоПрименения", Выборка.МестоПрименения);
		
		НайденныеСтроки = МестаПрименения.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Строка = МестаПрименения.Добавить();
		Иначе
			Строка = НайденныеСтроки[0];
		КонецЕсли;
		
		ОбработанныеСтроки.Добавить(Строка);
		
		ЗаполнитьЗначенияСвойств(Строка, Выборка);
		
	КонецЦикла;
	
	УдалитьНеОбработанныеСтрокиИзТаблицы(МестаПрименения, ОбработанныеСтроки);
	
	Если Параметризуется Тогда
		
		ОбработанныеСтроки.Очистить();
		СтруктураПоиска.Очистить();
		
		Выборка = РезультатЗапроса[ВГраница-1].Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СтруктураПоиска.Вставить("Значение", Выборка.Значение);
			
			НайденныеСтроки = ДоступныеЗначения.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() = 0 Тогда
				Строка = ДоступныеЗначения.Добавить();
			Иначе
				Строка = НайденныеСтроки[0];
			КонецЕсли;
			
			ОбработанныеСтроки.Добавить(Строка);
			
			ЗаполнитьЗначенияСвойств(Строка, Выборка);
			
			Типы = Новый Массив;
			Типы.Добавить(ТипЗнч(Строка.Значение));
			Строка.Тип = Новый ОписаниеТипов(Типы);
			
			Индекс = ИспользуемыеЗначения.Найти(Строка.Значение);
			Если Индекс <> Неопределено Тогда
				ИспользуемыеЗначения.Удалить(Индекс);
			КонецЕсли;
			Строка.Используется = Индекс <> Неопределено;
			
		КонецЦикла;
		
		Если ИспользуемыеЗначения.Количество() > 0 Тогда
			
			МаксимальныйИндекс = ИспользуемыеЗначения.ВГраница();
			Для Индекс = 0 По МаксимальныйИндекс Цикл
				
				СтруктураПоиска.Вставить("Значение", Выборка.Значение);
				
				НайденныеСтроки = ДоступныеЗначения.НайтиСтроки(СтруктураПоиска);
				Если НайденныеСтроки.Количество() = 0 Тогда
					Строка = ДоступныеЗначения.Вставить(0);
				Иначе
					Строка = НайденныеСтроки[0];
				КонецЕсли;
				
				ОбработанныеСтроки.Добавить(Строка);
				
				Строка.СтатусСтроки = СтатусСтрокиИспользуетсяИНедоступно();
				Строка.Используется = Истина;
				Строка.Значение = ИспользуемыеЗначения[МаксимальныйИндекс - Индекс];
				Типы = Новый Массив;
				Типы.Добавить(ТипЗнч(Строка.Значение));
				Строка.Тип = Новый ОписаниеТипов(Типы);
				
			КонецЦикла;
			
		КонецЕсли;
		
		УдалитьНеОбработанныеСтрокиИзТаблицы(ДоступныеЗначения, ОбработанныеСтроки);
		
		Данные = Новый Соответствие;
		Выборка = РезультатЗапроса[ВГраница].Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Данные[Выборка.МестоПрименения] = Неопределено Тогда
				Данные.Вставить(Выборка.МестоПрименения, Новый Массив);
			КонецЕсли;
			Если Данные[Выборка.МестоПрименения].Найти(Выборка.Значение) = Неопределено Тогда
				Данные[Выборка.МестоПрименения].Добавить(Выборка.Значение);
			КонецЕсли;
		КонецЦикла;
		ДоступныеЗначенияПоМестамПрименения = Новый ФиксированноеСоответствие(Данные);
		
		УстановитьПризнакИспользованияЗначенияПоМестуПрименения(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЗапросаДляЗаполненияДанныхТаблиц()
	
	Возврат
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ЗначенияЭлементовКонструктора.ВидПродукции, ЗначенияПользователяЭлементовКонструктора.ВидПродукции) КАК
	|		ВидПродукции,
	|	ЕСТЬNULL(ЗначенияЭлементовКонструктора.Значение, ЗначенияПользователяЭлементовКонструктора.Значение) КАК Значение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЗначенияПользователяЭлементовКонструктора.ПометкаУдаления, ЛОЖЬ)
	|			ТОГДА 4
	|		КОГДА ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора ЕСТЬ NULL
	|			ТОГДА 5
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК СтатусСтроки,
	|	ЕСТЬNULL(ЗначенияПользователяЭлементовКонструктора.Атрибуты, ЗначенияЭлементовКонструктора.Атрибуты) КАК Атрибуты
	|ИЗ
	|	РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктора
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК
	|			ЗначенияПользователяЭлементовКонструктора
	|		ПО ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора
	|		И ЗначенияЭлементовКонструктора.ВидПродукции = ЗначенияПользователяЭлементовКонструктора.ВидПродукции
	|		И ЗначенияЭлементовКонструктора.Значение = ЗначенияПользователяЭлементовКонструктора.Значение
	|ГДЕ
	|	ЗначенияЭлементовКонструктора.ЭлементКонструктора = &ЭлементКонструктора
	|	ИЛИ ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора = &ЭлементКонструктора
	|УПОРЯДОЧИТЬ ПО
	|	ВидПродукции,
	|	Значение
	|;
	|ВЫБРАТЬ
	|	МестаПримененияЭлементовКонструктораВидовПродукцииИС.МестоПрименения КАК МестоПрименения,
	|	ВЫБОР
	|		КОГДА МестаПримененияЭлементовКонструктораВидовПродукцииИС.ПометкаУдаления
	|			ТОГДА 4
	|		КОГДА МестаПримененияЭлементовКонструктораВидовПродукцииИС.Изменен
	|			ТОГДА 3
	|		ИНАЧЕ 5
	|	КОНЕЦ КАК СтатусСтроки
	|ИЗ
	|	РегистрСведений.МестаПримененияЭлементовКонструктораВидовПродукцииИС КАК
	|		МестаПримененияЭлементовКонструктораВидовПродукцииИС
	|ГДЕ
	|	МестаПримененияЭлементовКонструктораВидовПродукцииИС.ЭлементКонструктора = &ЭлементКонструктора
	|УПОРЯДОЧИТЬ ПО
	|	МестоПрименения
	|;
	|ВЫБРАТЬ
	|	ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС.Значение КАК Значение,
	|	ВЫБОР
	|		КОГДА ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС.ПометкаУдаления
	|			ТОГДА 4
	|		КОГДА ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС.Изменен
	|			ТОГДА 3
	|		ИНАЧЕ 5
	|	КОНЕЦ КАК СтатусСтроки
	|ИЗ
	|	РегистрСведений.ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС КАК
	|		ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС
	|ГДЕ
	|	ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС.ЭлементКонструктора = &ЭлементКонструктора
	|УПОРЯДОЧИТЬ ПО
	|	Значение
	|;
	|ВЫБРАТЬ
	|	ДоступныеЗначенияПоМестамПримененияЭлементовКонструктораВидовПродукцииИС.МестоПрименения КАК МестоПрименения,
	|	ДоступныеЗначенияПоМестамПримененияЭлементовКонструктораВидовПродукцииИС.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ДоступныеЗначенияПоМестамПримененияЭлементовКонструктораВидовПродукцииИС КАК
	|		ДоступныеЗначенияПоМестамПримененияЭлементовКонструктораВидовПродукцииИС
	|ГДЕ
	|	ДоступныеЗначенияПоМестамПримененияЭлементовКонструктораВидовПродукцииИС.ЭлементКонструктора = &ЭлементКонструктора
	|	И НЕ ДоступныеЗначенияПоМестамПримененияЭлементовКонструктораВидовПродукцииИС.ПометкаУдаления";
	
КонецФункции

&НаСервере
Процедура УдалитьНеОбработанныеСтрокиИзТаблицы(Таблица, ОбработанныеСтроки)
	
	МаксимальныйИндекс = Таблица.Количество() - 1;
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		ТекущийИндекс = МаксимальныйИндекс - Индекс;
		Если ОбработанныеСтроки.Найти(Таблица[ТекущийИндекс]) = Неопределено Тогда
			Таблица.Удалить(ТекущийИндекс);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеАтрибутов(Атрибуты)
	
	Результат = "";
	
	ЗначенияАтрибутов = Атрибуты.Получить();
	Если ТипЗнч(ЗначенияАтрибутов) = Тип("Структура") Тогда
		Представления = Новый Массив;
		Для Каждого Атрибут Из ЗначенияАтрибутов Цикл
			Представления.Добавить(
				СтрШаблон(НСтр("ru = '%1: %2'"),
				ОбщегоНазначенияИСКлиентСервер.ПредставлениеВстроенногоИмени(Атрибут.Ключ),
				Атрибут.Значение));
		КонецЦикла;
		Результат = СтрСоединить(Представления, "; ");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПрочитатьУстановитьПараметры()
	
	ПараметрыЭлемента = Справочники.ЭлементыКонструктораВидовПродукцииИС.ПараметрыЭлементаКонструктора(Объект.Ссылка);
	
	ТипЗначения = ПараметрыЭлемента.ТипЗначения;
	Параметризуется = ПараметрыЭлемента.Параметризуется;
	КаждомуВидуПродукцииСоответствуетОдноЗначение = ПараметрыЭлемента.КаждомуВидуПродукцииСоответствуетОдноЗначение;
	ИспользоватьАтрибуты = ПараметрыЭлемента.ИспользоватьАтрибуты;
	ИзменяетсяВИнтерфейсеПользователя = ПараметрыЭлемента.ИзменяетсяВИнтерфейсеПользователя;
	ПоВсемВидамПродукции = ПараметрыЭлемента.ПоВсемВидамПродукции;
	
	ИспользуетсяНесколькоТипов = Параметризуется И ТипЗначения.Типы().Количество() > 1;
	
	Элементы.ТипЗначения.Видимость = Параметризуется;
	Элементы.КаждомуВидуПродукцииСоответствуетОдноЗначение.Видимость = КаждомуВидуПродукцииСоответствуетОдноЗначение;
	Элементы.ИзменяетсяВИнтерфейсеПользователя.Видимость = ИзменяетсяВИнтерфейсеПользователя;
	Элементы.ПоВсемВидамПродукции.Видимость = ПоВсемВидамПродукции;
	
	Элементы.ЗначенияЗначение.Видимость = Параметризуется;
	Элементы.ЗначенияАтрибуты.Видимость = ИспользоватьАтрибуты;
	Элементы.ЗначенияТип.Видимость      = ИспользуетсяНесколькоТипов;
	
	Элементы.ДоступныеЗначения.Видимость = Параметризуется;
	Элементы.ДоступныеЗначенияТип.Видимость = ИспользуетсяНесколькоТипов;
	
	Если Параметризуется
		И ТипЗначения.Типы().Найти(Тип("Дата")) <> Неопределено
		И ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Дата Тогда
		Элементы.ЗначенияЗначение.Формат = "ДФ=dd.MM.yyyy;";
		Элементы.ДоступныеЗначенияЗначение.Формат = "ДФ=dd.MM.yyyy;";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВозможностьИспользования(Отказ)
	
	ТипМетаданных = Метаданные.ОпределяемыеТипы.ЗначениеЭлементаКонструктораВидовПродукцииИС.Тип;
	
	Для Каждого Тип Из ТипЗначения.Типы() Цикл
		Если Не ТипМетаданных.СодержитТип(Тип) Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр(
					"ru = 'Элемент конструктора <%1> содержит недопустимый тип <%2>'"),
					Объект.Ссылка,
					Тип));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКлючЗаписи(ИмяРегистра, ПараметрыКлючаЗаписи)
	
	Возврат РегистрыСведений[ИмяРегистра].СоздатьКлючЗаписи(ПараметрыКлючаЗаписи);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьИзДанныхНеПомеченныеНаУдаление(Данные)
	
	ВГраница = Данные.ВГраница();
	Для Индекс = 0 По ВГраница Цикл
		ТекущийИндекс = ВГраница - Индекс;
		Если Не Данные[ТекущийИндекс].ПометкаУдаления Тогда
			Данные.Удалить(ТекущийИндекс);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьДанныеРегистров(ПараметрыЗаписи)
	
	НачатьТранзакцию();
	
	Попытка
		
		Для Каждого ДанныеЗаписи Из ПараметрыЗаписи.Данные Цикл
			
			Запись = РегистрыСведений[ДанныеЗаписи.ИмяРегистра].СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, ДанныеЗаписи);
			Запись.ЭлементКонструктора = ПараметрыЗаписи.ЭлементКонструктора;
			Если ДанныеЗаписи.ИмяРегистра <> "ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС" Тогда
				Запись.Изменен = Истина;
			КонецЕсли;
			Запись.ПометкаУдаления = ДанныеЗаписи.ПометкаУдаления;
			Если ДанныеЗаписи.Свойство("УдалитьЗапись")
				И ДанныеЗаписи.УдалитьЗапись Тогда
				Запись.Удалить();
			Иначе
				Запись.Записать();
			КонецЕсли;
			
			Если ДанныеЗаписи.ПометкаУдаления
				И (ДанныеЗаписи.ИмяРегистра = "ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС"
				Или ДанныеЗаписи.ИмяРегистра = "МестаПримененияЭлементовКонструктораВидовПродукцииИС") Тогда
				Набор = РегистрыСведений.ДоступныеЗначенияПоМестамПримененияЭлементовКонструктораВидовПродукцииИС.СоздатьНаборЗаписей();
				Набор.Отбор.ЭлементКонструктора.Установить(ПараметрыЗаписи.ЭлементКонструктора);
				Если ДанныеЗаписи.Свойство("Значение") Тогда
					Набор.Отбор.Значение.Установить(ДанныеЗаписи.Значение);
				КонецЕсли;
				Если ДанныеЗаписи.Свойство("МестоПрименения") Тогда
					Набор.Отбор.МестоПрименения.Установить(ДанныеЗаписи.МестоПрименения);
				КонецЕсли;
				Набор.Прочитать();
				Для Каждого Запись Из Набор Цикл
					Запись.Изменен = Истина;
					Запись.ПометкаУдаления = ДанныеЗаписи.ПометкаУдаления;
				КонецЦикла;
				Набор.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьДоступныеЗначения(ПараметрыЗаписи)
	
	НачатьТранзакцию();
	
	Попытка
		
		Для Каждого ДанныеЗаписи Из ПараметрыЗаписи.Данные Цикл
			
			Если ДанныеЗаписи.ЗаписатьДоступноеЗначение Тогда
				Запись = РегистрыСведений.ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС.СоздатьМенеджерЗаписи();
				Запись.ЭлементКонструктора = ПараметрыЗаписи.ЭлементКонструктора;
				Запись.Значение = ДанныеЗаписи.Значение;
				Запись.Изменен = Истина;
				Запись.ПометкаУдаления = Ложь;
				Запись.Записать();
			КонецЕсли;
			
			Если ДанныеЗаписи.ЗаписатьДоступноеЗначениеПоМестуПрименения Тогда
				Запись = РегистрыСведений.ДоступныеЗначенияПоМестамПримененияЭлементовКонструктораВидовПродукцииИС.СоздатьМенеджерЗаписи();
				Запись.ЭлементКонструктора = ПараметрыЗаписи.ЭлементКонструктора;
				Запись.МестоПрименения = ПараметрыЗаписи.МестоПрименения;
				Запись.Значение = ДанныеЗаписи.Значение;
				Запись.Изменен = Истина;
				Запись.ПометкаУдаления = Ложь;
				Запись.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеОповещенияОкончаниеИзмененияЗначений()
	
	Возврат Новый ОписаниеОповещения("ОкончаниеИзмененияЗначений", ЭтотОбъект);
	
КонецФункции

&НаКлиенте
Процедура ОкончаниеИзмененияЗначений(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьДанныеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросДобавитьДоступноеЗначение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьДоступныеЗначения(ДополнительныеПараметры);
	ОбновитьДанныеФормы();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПризнакИспользованияЗначенияПоМестуПрименения(Форма)
	
	Если Не Форма.Параметризуется
		Или Форма.ДоступныеЗначения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Форма.Элементы.МестаПрименения.ТекущаяСтрока;
	
	Если ТекущаяСтрока = Неопределено Тогда
		МестоПрименения = Неопределено;
	Иначе
		ТекущиеДанные = Форма.МестаПрименения.НайтиПоИдентификатору(ТекущаяСтрока);
		Если ТекущиеДанные = Неопределено
			Или Не ЗначениеЗаполнено(ТекущиеДанные.МестоПрименения) Тогда
			МестоПрименения = Неопределено;
		Иначе
			МестоПрименения = ТекущиеДанные.МестоПрименения;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Строка Из Форма.ДоступныеЗначения Цикл
		Используется = Ложь;
		Если МестоПрименения <> Неопределено Тогда
			Данные = Форма.ДоступныеЗначенияПоМестамПрименения.Получить(МестоПрименения);
			Если Данные <> Неопределено Тогда
				Если Данные.Найти(Строка.Значение) <> Неопределено Тогда
					Используется = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Строка.ИспользуетсяПоМестуПрименения = Используется;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СтатусСтрокиИспользуетсяИНедоступно()
	Возврат 28;
КонецФункции

&НаКлиенте
Процедура ПослеВводаСтрокиСТоварнымиГруппамиИзДокументации(Строка, ДополнительныеПараметры) Экспорт

	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Найти выделенные строки в динамическом списке Значения
	// и из этих строк ВидПродукции положить в соответствие, где значением является признак удаления
	ТоварныеГруппы = Новый Соответствие();
	Для Каждого ВыделеннаяСтрока Из Элементы.Значения.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.Значения.ДанныеСтроки(ВыделеннаяСтрока);
		
		ТоварнаяГруппа = КонструкторИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппаПоВидуПродукции(ДанныеСтроки.ВидПродукции);
		
		Если ТоварнаяГруппа = Неопределено
			Или ТоварныеГруппы[ТоварнаяГруппа] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТоварныеГруппы.Вставить(ТоварнаяГруппа, ДанныеСтроки.СтатусСтроки = 4);
		
	КонецЦикла;
	
	СравнитьВыделенныеВидыПродукцииСоСпискомНаСервере(Строка, ТоварныеГруппы);
	
КонецПроцедуры

&НаСервере
Процедура СравнитьВыделенныеВидыПродукцииСоСпискомНаСервере(Строка, ТоварныеГруппы)
	
	ТоварныеГруппыКУдалению = Новый Массив;
	ТоварныеГруппыКДобавлению = Новый Массив;
	
	// Выделить из строки документации товарные группы. Пример строки: "Тест1", "Тест2". Убрать кавычки.
	ТоварныеГруппыИзДокументации = Новый Массив;
	Текст = СтрЗаменить(Строка, Символы.ПС, " ");
	Текст = СтрЗаменить(Текст, "  ", " ");
	Текст = СтрЗаменить(Текст, "», «", "|");
	Текст = СтрЗаменить(Текст, "»", "");
	Текст = СтрЗаменить(Текст, "«", "");
	
	// Выбрать из справочника Товарные группы ГИС МТ все значения
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ТоварныеГруппыГИСМТ.Ссылка КАК Ссылка,
	|	ТоварныеГруппыГИСМТ.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ТоварныеГруппыГИСМТ КАК ТоварныеГруппыГИСМТ
	|");
	Выборка = Запрос.Выполнить().Выбрать();
	
	СинонимыПоУмолчанию = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		СинонимыПоУмолчанию.Вставить(Выборка.Наименование, Выборка.Ссылка);
	КонецЦикла;
	
	Для Каждого ИмяТоварнойГруппы Из СтрРазделить(Текст, "|", Ложь) Цикл
		
		СинонимТоварнойГруппыИзДокументации = УдалитьКавычки(СокрЛП(ИмяТоварнойГруппы));
		
		НайденныеВидыПродукции = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоСинониму(СинонимТоварнойГруппыИзДокументации);
		Для Каждого ВидПродукции Из НайденныеВидыПродукции Цикл
			ТоварнаяГруппа = КонструкторИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппаПоВидуПродукции(ВидПродукции);
			ТоварныеГруппыИзДокументации.Добавить(ТоварнаяГруппа);
		КонецЦикла;
		
		Если СинонимыПоУмолчанию[СинонимТоварнойГруппыИзДокументации] <> Неопределено Тогда
			ТоварныеГруппыИзДокументации.Добавить(СинонимыПоУмолчанию[СинонимТоварнойГруппыИзДокументации]);
		ИначеЕсли НайденныеВидыПродукции.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(
					НСтр("ru = 'Не удалось определить вид продукции по синониму: %1'"), 
					СинонимТоварнойГруппыИзДокументации));
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ТоварнаяГруппаИзДокументации Из ТоварныеГруппыИзДокументации Цикл
		ПризнакУдаления = ТоварныеГруппы[ТоварнаяГруппаИзДокументации];
		Если ПризнакУдаления = Неопределено Или ПризнакУдаления = Истина Тогда
			ТоварныеГруппыКДобавлению.Добавить(ТоварнаяГруппаИзДокументации);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из ТоварныеГруппы Цикл
		ТоварнаяГруппа  = КлючИЗначение.Ключ;
		ПризнакУдаления = КлючИЗначение.Значение;
		Если ТоварныеГруппыИзДокументации.Найти(ТоварнаяГруппа) = Неопределено
			И Не ПризнакУдаления Тогда
			ТоварныеГруппыКУдалению.Добавить(ТоварнаяГруппа);
		КонецЕсли;
	КонецЦикла;
	
	Если ТоварныеГруппыКУдалению.Количество() > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Удалить: %1'"), СтрСоединить(ТоварныеГруппыКУдалению, ", ")));
	КонецЕсли;
	
	Если ТоварныеГруппыКДобавлению.Количество() > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Добавить: %1'"), СтрСоединить(ТоварныеГруппыКДобавлению, ", ")));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УдалитьКавычки(ЗНАЧ ИмяТоварнойГруппы)
	
	Если Лев(ИмяТоварнойГруппы, 1) = """"
		И Прав(ИмяТоварнойГруппы, 1) = """" Тогда
		ИмяТоварнойГруппы = Сред(ИмяТоварнойГруппы, 2, СтрДлина(ИмяТоварнойГруппы) - 2);
	КонецЕсли;
	
	Возврат СокрЛП(ИмяТоварнойГруппы);
	
КонецФункции

&НаКлиенте
Асинх Процедура ЗаполнитьПоЭлементуПродолжение(Элемент, ДополнительныеПараметры) Экспорт

	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипЗначения = ПоддерживаемыеТипыЭлемента(Элемент);
	
	Тип = Неопределено;
	Если ТипЗначения.Типы().Количество() > 1 Тогда
		
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений.ЗагрузитьЗначения(ТипЗначения.Типы());
		
		Обещание = Ждать ВыбратьИзСпискаАсинх(СписокЗначений);
		
		Тип = Обещание.Значение;
		
	КонецЕсли;
	
	СкопироватьЗначенияЭлемента(Объект.Ссылка, Элемент, Тип);
	
	Элементы.Значения.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьДоступныеЗначенияПродолжение(Элемент, ДополнительныеПараметры) Экспорт

	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СкопироватьДоступныеЗначенияПродолжениеСервер(Объект.Ссылка, Элемент);
	
	Элементы.ДоступныеЗначения.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СкопироватьДоступныеЗначенияПродолжениеСервер(ЭлементКонструктора, ЭлементДляКопирования)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	&ЭлементКонструктора КАК ЭлементКонструктора,
		|	ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС.Значение
		|ИЗ
		|	РегистрСведений.ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС КАК
		|		ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС
		|ГДЕ
		|	ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС.ЭлементКонструктора = &ЭлементДляКопирования";
	
	Запрос.УстановитьПараметр("ЭлементДляКопирования", ЭлементДляКопирования);
	Запрос.УстановитьПараметр("ЭлементКонструктора",   ЭлементКонструктора);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		МенеджерЗаписи = РегистрыСведений.ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		МенеджерЗаписи.Записать();
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоддерживаемыеТипыЭлемента(Элемент)
	
	ПараметрыЭлемента = Справочники.ЭлементыКонструктораВидовПродукцииИС.ПараметрыЭлементаКонструктора(Элемент);
	
	ТипЗначения = ПараметрыЭлемента.ТипЗначения;
	
	Возврат ТипЗначения;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СкопироватьЗначенияЭлемента(ЭлементКонструктора, ЭлементДляКопирования, Тип)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	&ЭлементКонструктора КАК ЭлементКонструктора,
		|	ДанныеДляЗаписи.ВидПродукции,
		|	ДанныеДляЗаписи.Значение,
		|	ДанныеДляЗаписи.Атрибуты
		|ИЗ
		|	РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ДанныеДляЗаписи
		|ГДЕ
		|	ДанныеДляЗаписи.ЭлементКонструктора = &ЭлементДляКопирования
		|	И ТИПЗНАЧЕНИЯ(ДанныеДляЗаписи.Значение) = &Тип
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ЭлементКонструктора КАК ЭлементКонструктора,
		|	ДанныеДляЗаписи.ВидПродукции,
		|	ДанныеДляЗаписи.Значение,
		|	ДанныеДляЗаписи.Атрибуты
		|ИЗ
		|	РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ДанныеДляЗаписи
		|ГДЕ
		|	ДанныеДляЗаписи.ЭлементКонструктора = &ЭлементДляКопирования
		|	И ТИПЗНАЧЕНИЯ(ДанныеДляЗаписи.Значение) = &Тип";
	
	Запрос.УстановитьПараметр("ЭлементДляКопирования", ЭлементДляКопирования);
	Запрос.УстановитьПараметр("ЭлементКонструктора",   ЭлементКонструктора);
	
	Если Тип = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТИПЗНАЧЕНИЯ(ДанныеДляЗаписи.Значение) = &Тип", "Истина");
	Иначе
		Запрос.УстановитьПараметр("Тип", Тип);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		НаборЗаписей = РегистрыСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЭлементКонструктора.Установить(ЭлементКонструктора);
		НаборЗаписей.Отбор.Значение.Установить(Выборка.Значение);
		НаборЗаписей.Отбор.ВидПродукции.Установить(Выборка.ВидПродукции);
		
		СтрокаЗаписи = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗаписи, Выборка);
		
		НаборЗаписей.Записать();
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
